app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def edit
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM "games" WHERE ("games"."id" = 953125641)
DELETE FROM "games" WHERE "id" = 953125641