app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches" INNER JOIN "games" ON "matches".id = "games".match_id WHERE (("games".player_id = 2))
SELECT "players".* FROM "players" INNER JOIN "games" ON "players".id = "games".player_id WHERE (("games".match_id = 2)) ORDER BY players.id DESC LIMIT 1
---
  def index
    @matches = Match.all :include => :players, :order => "created_at DESC"

SELECT * FROM "matches" WHERE ("matches"."id" = 1)
---
  def show
    @match = Match.find(params[:id])

INSERT INTO "matches" ("updated_at", "number", "created_at") VALUES('2009-03-31 07:08:45', NULL, '2009-03-31 07:08:45')
---
  def create
    @match = Match.new(params[:match])
    if @match.save

SELECT * FROM "matches" WHERE ("matches"."id" = 2)
---
  def edit
    @match = Match.find(params[:id])

SELECT * FROM "matches" WHERE ("matches"."id" = 3)
---
  def update
    @match = Match.find(params[:id])

SELECT * FROM "matches" WHERE ("matches"."id" = 1)
DELETE FROM "matches" WHERE "id" = 1
---
  def destroy
    @match = Match.find(params[:id])
    @match.destroy