app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT * FROM "players"

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def create
    @player = Player.new(params[:player])
    if @player.save
---
INSERT INTO "players" ("name", "updated_at", "created_at") VALUES('Alan', '2009-03-31 05:33:54', '2009-03-31 05:33:54')

  def edit
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 953125641)

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
DELETE FROM "players" WHERE "id" = 1